package homework15;

import java.util.Random;

public class AdultAdvisor implements Advisor {
    @Override
    public String advise(Day day) {
        String result = "Сьогодні " + day.getDayNumber() + "-й день тижня, " + day.getName() + ". ";
        switch (day) {
            case MONDAY, TUESDAY, WEDNESDAY, THURSDAY:
                result += getRandomBoringAdvise();
                break;
            case FRIDAY:
                result += "Робочий тиждень майже позаду! Чудова нагода зустрітися з друзями на келих пива та розслабитись.";
                break;
            case SATURDAY:
                result += "Нарешті вихідний! Можливо, варто сходити в кіно на довгоочікувану прем'єру?";
                break;
            case SUNDAY:
                result += "Чудовий вечір для культурного відпочинку. Як щодо походу в театр чи на виставку?";
                break;
            default:
                result += "Нео, ти в матриці!";
                break;
        }
        return  result;
    }

    @Override
    public String getRandomBoringAdvise() {
        String[] AdvArray = {
                "Складіть чіткий план завдань на день, щоб нічого не забути і бути максимально продуктивним.",
                "Не забувайте робити короткі перерви кожну годину, щоб зберегти концентрацію та уникнути перевтоми.",
                "Перевірте робочу пошту та розберіть найважливіші листи ще зранку.",
                "Приділіть 15 хвилин увечері для швидкого прибирання, щоб підтримувати порядок вдома.",
                "Сьогодні чудовий день, щоб вирішити те складне завдання, яке ви довго відкладали.",
                "Не забувайте пити достатньо води протягом дня - це запорука гарного самопочуття.",
                "Після роботи знайдіть час для легкої фізичної активності: прогулянки, пробіжки або зарядки.",
                "Підготуйте одяг та обід на завтрашній день звечора, щоб ранок був спокійнішим.",
                "Сплануйте вечерю наперед, щоб не витрачати час на роздуми після важкого робочого дня.",
                "Зробіть щось корисне для себе: почитайте професійну літературу або послухайте освітній подкаст."
        };

        Random random = new Random();
        int randomIndex = random.nextInt(AdvArray.length);
        return AdvArray[randomIndex];
    }
}
