package homework15;

import java.util.Random;

public class ChildAdvisor implements Advisor {
    @Override
    public String advise(Day day) {
        String result = "Сьогодні " + day.getDayNumber() + "-й день тижня, " + day.getName() + ". ";
        switch (day) {
            case MONDAY, TUESDAY, WEDNESDAY, THURSDAY:
                result += getRandomBoringAdvise();
                break;
            case FRIDAY:
                result += "Після школи нарешті можна пограти в комп'ютер!";
                break;
            case SATURDAY:
                result += "На вихідних добре відпочинь, проведи час із сім'єю та друзями.";
                break;
            case SUNDAY:
                result += "Присвяти час своєму хобі або дізнайся щось нове, не пов'язане зі школою.";
                break;
            default:
                result += "Здоров малеча! Цей текст теоретично ніхто не побачить, але раптом стався збій - повідом батькам!";
                break;
        }
        return  result;
    }

    @Override
    public String getRandomBoringAdvise() {
        String[] AdvArray = {
                "Сьогодні треба гарно вчитись, зробити всі уроки.",
                "Не забудь повторити минулу тему, щоб краще її закріпити.",
                "Уважно слухай на уроках, щоб усе зрозуміти.",
                "Знання - це твоя суперсила, використовуй її!",
                "Склади план на день, щоб нічого не забути і все встигнути.",
                "Спочатку уроки, а потім відпочинок та ігри.",
                "Тримай своє робоче місце в чистоті та порядку.",
                "Не бійся ставити запитання вчителю, якщо щось незрозуміло.",
                "Прочитай сьогодні кілька сторінок корисної книги.",
                "Допоможи однокласнику, якщо бачиш, що йому потрібна допомога.",
                "Будь активним на уроках і не бійся висловлювати свою думку.",
                "Перевір, чи всі домашні завдання записані у щоденнику.",
                "Гарна оцінка - це результат твоєї старанної праці.",
                "Вивчай щодня 5 нових слів з іноземної мови.",
                "Підготуй портфель та одяг на завтра ще з вечора.",
                "Намагайся писати охайно і без помилок.",
                "Кожен вивчений параграф наближає тебе до успіху.",
                "Не відкладай на завтра те, що можна вивчити сьогодні.",
                "Розв'яжи додаткову задачу, щоб потренувати свій розум."
        };

        Random random = new Random();
        int randomIndex = random.nextInt(AdvArray.length);
        return AdvArray[randomIndex];
    }
}
