package homework15;

import java.util.Random;

public class OldAdvisor implements Advisor {
    @Override
    public String advise(Day day) {
        String result = "Сьогодні " + day.getDayNumber() + "-й день тижня, " + day.getName() + ". ";
        switch (day) {
            case MONDAY, TUESDAY, WEDNESDAY, THURSDAY:
                result += getRandomBoringAdvise();
                break;
            case FRIDAY:
                result += "Час для генерального походу на ринок! Треба закупити все для фірмових пиріжків, бо на вихідні ж приїдуть онуки (або хоча б подзвонять).";
                break;
            case SATURDAY:
                result += "Пора вирощувати розсаду на підвіконні, уважно дивлячись у вікно за сусідами!";
                break;
            case SUNDAY:
                result += "Можна неспішно прогулятися в парку, погодувати качок і зателефонувати подрузі, щоб остаточно затвердити, хто з політиків у телевізорі неправий.";
                break;
            default:
                result += "Насправді вам все ще 12 років і це ваш сон!";
                break;
        }
        return result;
    }

    @Override
    public String getRandomBoringAdvise() {
        String[] AdvArray = {
                "Час вставати! Якщо вийти прямо зараз, є шанс зайняти перше місце в черзі до поліклініки.",
                "Не забудьте зранку поміряти тиск. І в обід. І ввечері. Треба ж знати, на що скаржитися сусідам по телефону.",
                "Сьогодні нова серія улюбленого серіалу. Головне — встигнути обдзвонити всіх подруг і обговорити, що було вчора.",
                "Лавочка біля під'їзду не буде сидіти порожньою! Всі свіжі новини району чекають на ваше експертне обговорення.",
                "Ідеальний день, щоб сходити на ринок. Треба особисто перевірити, чи не обманюють продавці з цінами на кріп та петрушку.",
                "Зателефонуйте дітям та онукам. Важливо нагадати їм, що ви погано спали і що треба тепліше вдягатися, бо на вулиці вітер.",
                "Голуби на площі чекають на свій сніданок. Хто, як не ви, подбає про стратегічний запас хлібних крихт?",
                "Час розібратися з квитанціями за комуналку. Це краще за будь-який кросворд, і головне — з реальними наслідками!",
                "Згадайте, до якого лікаря ви давно не ходили. Навіть якщо нічого не болить, профілактичний візит — чудова нагода поспілкуватися в черзі.",
                "Знайдіть стару фотографію і пориньте у спогади. А потім розкажіть онукам, що раніше і трава була зеленішою, і ковбаса по 2.20."
        };

        Random random = new Random();
        int randomIndex = random.nextInt(AdvArray.length);
        return AdvArray[randomIndex];
    }
}
